blog/language/common_phrases.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-07 Sat 15:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>常用句子</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Hsin-Yi" />
<link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">常用句子</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">垃圾話</a></li>
<li><a href="#orgheadline2">用餐</a></li>
<li><a href="#orgheadline3">討論事情常用句</a></li>
<li><a href="#orgheadline4">筆戰常用句</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">垃圾話</h2>
<div class="outline-text-2" id="text-orgheadline1">
<dl class="org-dl">
<dt>shoot the shit</dt><dd>閒聊</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">用餐</h2>
<div class="outline-text-2" id="text-orgheadline2">
<ul class="org-ul">
<li>Are you full? 飽了嗎?</li>
<li>Are you hungry? 餓了嗎？</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">討論事情常用句</h2>
<div class="outline-text-2" id="text-orgheadline3">
<dl class="org-dl">
<dt>Definitely worth looking into</dt><dd>值得深入了解</dd>
<dt>it is just my speculation</dt><dd>只是我的猜測</dd>
<dt>We need to understand at least a decent estimate of how much time we’d be investing to do it this way from here onwards</dt><dd>&#x2026;..</dd>
<dt>Do you think I’m off base with these estimates?</dt><dd>你有覺得我有估太多久的時間嗎?</dd>
<dt>It is my gut feeling</dt><dd>這是我的直覺</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">筆戰常用句</h2>
<div class="outline-text-2" id="text-orgheadline4">
<dl class="org-dl">
<dt>it’s a huge can of worms</dt><dd>to create a situation that will cause trouble or be unpleasant</dd>
<dt>that’s a strawman</dt><dd>那是的稻草人謬誤</dd>
<dt>so again going in circles now.</dt><dd>我們又在繞圈子了。</dd>
<dt>that was then and this is now</dt><dd>此一時非彼一時。</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen Hsin-Yi</p>
<p class="date">Created: 2016-05-07 Sat 15:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
